# Les Series

## Création d’une Series à partir d'une liste

In [45]:
import pandas as pd
data = [10, 20, 30, 40]
series = pd.Series(data)
series

0    10
1    20
2    30
3    40
dtype: int64

## Création d’une Series à partir d'un dictionnaire

In [46]:
data = {'a': 1, 'b': 2, 'c': 3}
series = pd.Series(data)
series

a    1
b    2
c    3
dtype: int64

## Création d’une Series avec un index personnalisé

In [47]:
data = [10, 20, 30]
index = ['a', 'b', 'c']
series = pd.Series(data, index=index)
series

a    10
b    20
c    30
dtype: int64

## Accès aux éléments d'une Series

In [48]:
data = [10, 20, 30]
index = ['a', 'b', 'c']
series = pd.Series(data, index=index)
print(series.iloc[0])
print(series['c'])

10
30

# Les DataFrames

In [49]:
import pandas as pd

df = pd.read_csv("prets.csv")

In [50]:
df.columns

Index(['identifiant', 'ville', 'CP', 'revenu', 'remboursement', 'duree',
       'type', 'taux'],
      dtype='object')

In [51]:
df.shape

(244, 8)

In [52]:
nb_villes = df['ville'].nunique()
nb_villes

6

### Créer un nouvel attribut « taux_endettement » qui calcule le taux d'endettement de chaque individu.

In [53]:
df["taux_endettement"] = (df["remboursement"] * 100 / df["revenu"]).round(2)

### Renommez la variable « taux » en « taux_interet »

In [54]:
df.rename({"taux": "taux_interet"}, axis=1, inplace=True)
df.head()

,identifiant,ville,CP,revenu,remboursement,duree,type,taux_interet,taux_endettement
0,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168,30.80
1,1,PARIS,75009,5310.0,240.00,64,automobile,3.701,4.52
2,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173,23.50
3,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972,29.50
4,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014,34.80

### Créer deux autres variables :
− cout_total : le cout total du prêt à partir du remboursement et de la durée

− benefices : les bénéfices mensuels réalisés par la banque sur le prêt

bénéfices = (C∗T)/24 

avec : C = cout total du prêt ; T = taux d'intérêt

In [55]:
df["cout_total"] = df["remboursement"] * df["duree"]
df["benefices"] = (df["cout_total"] * df["taux_interet"]) / 24
df.head()

,identifiant,ville,CP,revenu,remboursement,duree,type,taux_interet,taux_endettement,cout_total,benefices
0,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168,30.80,271212.0,13198.984000
1,1,PARIS,75009,5310.0,240.00,64,automobile,3.701,4.52,15360.0,2368.640000
2,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173,23.50,374355.0,18296.600625
3,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972,29.50,132609.6,5370.688800
4,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014,34.80,105485.4,4456.758150

### Afficher les 5 prêts ayant le plus de bénéfices

In [56]:
top_benefices = df.sort_values("benefices", ascending=False).head(5)
top_benefices

,identifiant,ville,CP,revenu,remboursement,duree,type,taux_interet,taux_endettement,cout_total,benefices
8,7,NICE,6000,5486.0,2956.95,300,immobilier,1.184,53.9,887085.0,43762.8600
23,22,NICE,6300,5838.0,3018.25,240,immobilier,1.229,51.7,724380.0,37094.2925
186,173,PARIS,75006,6784.0,3744.77,180,immobilier,1.248,55.2,674058.6,35051.0472
242,226,PARIS,75002,5098.0,2910.96,240,immobilier,1.140,57.1,698630.4,33184.9440
181,168,PARIS,75003,6366.0,2807.41,240,immobilier,1.176,44.1,673778.4,33015.1416

### Récupérer le nombre de personnes ayant dépassé 40% du taux d’endettement autorisé. Sauvegarder la liste dans une nouvelle variable nommé « clients_risque »

In [57]:
clients_risque = df[df["taux_endettement"] > 40]
print("Nombre de clients  risque :", len(clients_risque))

Nombre de clients  risque : 26

### Ajouter une variable nommée « risque » qui a comme valeur « Oui » si le client est risqué (taux d’endettement > 40%), « Non » sinon.

In [58]:
df["risque"] = df["taux_endettement"].apply(lambda x: "Oui" if x > 40 else "Non")
df

,identifiant,ville,CP,revenu,remboursement,duree,type,taux_interet,taux_endettement,cout_total,benefices,risque
0,0,TOULOUSE,31100,3669.0,1130.05,240,immobilier,1.168,30.80,271212.0,13198.984000,Non
1,1,PARIS,75009,5310.0,240.00,64,automobile,3.701,4.52,15360.0,2368.640000,Non
2,1,PARIS,75009,5310.0,1247.85,300,immobilier,1.173,23.50,374355.0,18296.600625,Non
3,2,MARSEILLE,13010,1873.0,552.54,240,immobilier,0.972,29.50,132609.6,5370.688800,Non
4,3,MARSEILLE,13010,1684.0,586.03,180,immobilier,1.014,34.80,105485.4,4456.758150,Non
...,...,...,...,...,...,...,...,...,...,...,...,...
239,224,PARIS,75008,5118.0,1248.79,300,immobilier,1.206,24.40,374637.0,18825.509250,Non
240,224,PARIS,75008,5118.0,238.20,25,automobile,3.423,4.65,5955.0,849.331875,Non
241,225,BORDEAUX,33100,2356.0,876.43,180,immobilier,1.172,37.20,157757.4,7703.819700,Non
242,226,PARIS,75002,5098.0,2910.96,240,immobilier,1.140,57.10,698630.4,33184.944000,Oui
243,227,PARIS,75015,2348.0,434.38,300,immobilier,1.157,18.50,130314.0,6282.220750,Non

### Récupérer le nombre de prêts automobiles accordés ? Quel est le coût total moyen de ces derniers ?

In [59]:
nb_pret_auto = df[df["type"] == "automobile"].shape[0]
print("Nombre de prets auto :", nb_pret_auto)

Nombre de prets auto : 16

In [60]:
cout_moyen_auto = df[df["type"] == "automobile"]["cout_total"].mean()
print("Cout total moyen des prets auto :", round(cout_moyen_auto, 2))

Cout total moyen des prets auto : 13665.0

### Afficher le bénéfice mensuel total réalisé par l’agence Parisienne.

In [61]:
benefice_paris = df[df["ville"] == "PARIS"]["benefices"].sum()
print("Benefice total mensuel de Paris :", round(benefice_paris, 2))

Benefice total mensuel de Paris : 1001633.06